[
    "Pay It Forward: Buy coffee/a small treat for the person behind you in line.",
    "Leave a positive note: Write an uplifting message on a sticky note and leave it somewhere public (a bathroom mirror, a library book).",
    "Unexpected compliment: Give a sincere compliment to someone you don't know well.",
    "Give something away: Find something you don't use anymore and donate it to someone in need.",
    "Volunteer your time: Spend even a short amount of time helping at a local shelter, food drive, or another cause you care about.",
    "Device-free time: Set aside 30 minutes for a tech break—no screens allowed. Go for a walk, read a book, or just sit and enjoy the quiet.",
    "Mindful meal: During one meal, focus on savoring each bite, the smells, and the textures of your food.",
    "The gratitude list: Write down three things you're grateful for at the end of each day.",
    "Meditation moment: Try a 5-minute guided meditation (apps like Headspace and Calm offer great resources).",
    "Sunset/sunrise appreciation: Take a few minutes at sunrise or sunset to simply observe the beauty of the sky.",
    "Reach out to an old friend: Call or text someone you haven't connected with in a while.",
    "Make a loved one smile: Do a small, unexpected favor to brighten someone's day.",
    "How's your day?: Have a meaningful conversation with someone you usually just exchange pleasantries with (a barista, coworker, etc.).",
    "Handwritten note: Take the time to write a genuine, handwritten thank you note or letter to someone.",
    "Offer to help: Ask a neighbor or friend if there's anything you can do to lighten their load.",
    "The music boost: Create a short 'happy vibes' playlist and dance to it!",
    "Explore somewhere new: Take a walk in a different part of your neighborhood/town.",
    "Silly face challenge: Take the silliest selfie you can. Send it to a friend to make them laugh.",
    "Try a new recipe: Pick a recipe with an ingredient or cuisine you've never tried before.",
    "Random act of silliness: Do something purely for fun, like blowing bubbles or skipping down the street.",
    "The curiosity challenge: Ask someone you interact with regularly (barista, coworker) a question about something other than the usual exchange. ('That's a cool pin, what's the story behind it?').",
    "Share your 'small win': Tell someone about a small thing that went well today, even if it seems silly. ('My plants are actually still alive!').",
    "The waiting room compliment: If you're stuck waiting somewhere, give a stranger a specific, genuine compliment. Leave it at that, no conversation needed.",
    "Share a favorite thing: Bring a small object you enjoy (a photo, a lucky keychain) and tell someone briefly why it matters to you.",
    "Digital kindness postcard: Find a free online postcard service. Send a short note of encouragement to someone you haven't spoken to in ages.",
    "Cloud spotting, upgraded: Don't just find shapes, invent elaborate stories about the clouds (spy missions, migrating herds of fluffy creatures).",
    "Give something a name: Your water bottle, your desk chair, etc. Now treat it like a slightly eccentric pet for the rest of the day.",
    "The 5-4-3-2-1 sense check: Pause to notice: 5 things you see, 4 you hear, 3 you feel, 2 you smell, 1 you taste.",
    "Music shuffle prophecy: Hit shuffle on your music. The first line of the song is a cryptic prediction for your day.",
    "Pocket scavenger hunt: Give yourself 5 minutes to find something specific in your pockets/bag (a blue item, something soft, etc.)."
]